<!-- @SpinnerComponent -->
<!-- ⚫️⚫️☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰ -->

// 🌀🌀💻 HTML 💻🌀🌀
<template>
  <!-- 🎵🎵🔲🔲◾☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰ -->
  <h1>
    <b>Loading...</b>
  </h1>
  <progress class="progress is-large is-info" />
  <!-- 🎵🎵🔲🔲◾☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰ -->
</template>
<!-- ⚫️⚫️☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰ -->


// 🌀🌀💻 STYLES 💻🌀🌀
<style lang="scss">
h1 {
  font-family: 'Amazon Ember Duospace', sans-serif;
  font-size: 1.8rem;
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 200px;
  color: white;
  text-shadow: 2px 1px 4px grey;
}
</style>
<!-- ⚫️⚫️☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰ -->
